recept/src/Documents/Производство/Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Производство</name>
  <registerRecords>AccumulationRegister.СтадииВыполненияЗаказов</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РольКомпонента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СборкаКомплектов</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/AccumulationRegisters/СтадииВыполненияЗаказов/СтадииВыполненияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтадииВыполненияЗаказов</name>
  <resources>
    <name>ВЗаявке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВПроизводстве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Готово</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыРезервы</registerRecords>
  <registerRecords>AccumulationRegister.СтадииВыполненияЗаказов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Производство</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НДССтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Documents/Производство/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
        ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// 1. Инициализация и очистка движений
	Движения.СтадииВыполненияЗаказов.Записывать = Истина;
	Движения.СтадииВыполненияЗаказов.Очистить();
	
	// Блокировка данных для исключения конкурентного списания
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СтадииВыполненияЗаказов");
	ЭлементБлокировки.УстановитьЗначение("Номенклатура", Номенклатура);
	ЭлементБлокировки.УстановитьЗначение("Характеристика", Характеристика);
	Блокировка.Заблокировать();
	
	// 2. Запрос остатков по ФИФО (сортировка по дате документа-заказа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Остатки.ЗаказКлиента КАК ЗаказКлиента,
		|	Остатки.ВЗаявкеОстаток КАК ВЗаявкеОстаток
		|ИЗ
		|	РегистрНакопления.СтадииВыполненияЗаказов.Остатки(
		|		&МоментВремени,
		|		Номенклатура = &Номенклатура
		|			И Характеристика = &Характеристика
		|	) КАК Остатки
		|ГДЕ
		|	Остатки.ВЗаявкеОстаток > 0
		|УПОРЯДОЧИТЬ ПО
		|	Остатки.ЗаказКлиента.Дата ВОЗР"; // Сортировка ФИФО
		
	Запрос.УстановитьПараметр("МоментВремени",  МоментВремени());
	Запрос.УстановитьПараметр("Номенклатура",   Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Если заявок нет, а производство проводится (перепроизводство разрешено по ТЗ)
	Если РезультатЗапроса.Пустой() Тогда
		// Оформляем как производство без заказа
		Движение = Движения.СтадииВыполненияЗаказов.ДобавитьПриход();
		Движение.Период         = Дата;
		Движение.Номенклатура   = Номенклатура;
		Движение.Характеристика = Характеристика;
		Движение.ЗаказКлиента   = Документы.ЗаказКлиента.ПустаяСсылка();
		Движение.ВПроизводстве  = Количество;
		Возврат;
	КонецЕсли;
	
	ОсталосьРаспределить = Количество;
	Выборка = РезультатЗапроса.Выбрать();
	
	// 3. Распределение по заказам
	Пока Выборка.Следующий() И ОсталосьРаспределить > 0 Цикл
		
		РаспределяемНаЗаказ = Мин(ОсталосьРаспределить, Выборка.ВЗаявкеОстаток);
		
		// Минусуем стадию "ВЗаявке"
		ДвижениеРасход = Движения.СтадииВыполненияЗаказов.ДобавитьРасход();
		ДвижениеРасход.Период        = Дата;
		ДвижениеРасход.Номенклатура   = Номенклатура;
		ДвижениеРасход.Характеристика = Характеристика;
		ДвижениеРасход.ЗаказКлиента   = Выборка.ЗаказКлиента;
		ДвижениеРасход.ВЗаявке        = РаспределяемНаЗаказ;
		
		// Плюсуем стадию "ВПроизводстве"
		ДвижениеПриход = Движения.СтадииВыполненияЗаказов.ДобавитьПриход();
		ДвижениеПриход.Период        = Дата;
		ДвижениеПриход.Номенклатура   = Номенклатура;
		ДвижениеПриход.Характеристика = Характеристика;
		ДвижениеПриход.ЗаказКлиента   = Выборка.ЗаказКлиента;
		ДвижениеПриход.ВПроизводстве  = РаспределяемНаЗаказ;
		
		ОсталосьРаспределить = ОсталосьРаспределить - РаспределяемНаЗаказ;
		
	КонецЦикла;
	
	// 4. Если осталось количество (Перепроизводство относительно существующих заявок)
	Если ОсталосьРаспределить > 0 Тогда
		// Оставшийся излишек вешаем на пустой заказ (или на последний обработанный)
		ДвижениеИзлишек = Движения.СтадииВыполненияЗаказов.ДобавитьПриход();
		ДвижениеИзлишек.Период        = Дата;
		ДвижениеИзлишек.Номенклатура   = Номенклатура;
		ДвижениеИзлишек.Характеристика = Характеристика;
		ДвижениеИзлишек.ЗаказКлиента   = Документы.ЗаказКлиента.ПустаяСсылка();
		ДвижениеИзлишек.ВПроизводстве  = ОсталосьРаспределить;
	КонецЕсли;
	
КонецПроцедуры
